# YOLOv11 Ultimate Custom Model

nc: 7
scales:
  depth_mult: 1.75
  width_mult: 1.25
  max_channels: 2048

backbone:
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [256]]
  - [-1, 6, C2f, [512]]
  - [-1, 6, C2f, [512]]
  - [-1, 1, SPPF, [1024, 5]]

neck:
  - [-1, 3, C2f, [1024]]
  - [-1, 1, Conv, [512]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]
  - [-1, 1, Conv, [256]]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

head:
  - [[-1], 1, Detect, [nc]]
